phanbagiabao2001/EDK2-STM32/Drivers/ConfigDxe/ConfigDxe.c
/** @file
 *
 *  Copyright (c) 2019 - 2020, ARM Limited. All rights reserved.
 *  Copyright (c) 2018 - 2020, Andrei Warkentin <andrey.warkentin@gmail.com>
 *
 *  SPDX-License-Identifier: BSD-2-Clause-Patent
 *
 **/

#include <Uefi.h> 
#include <IndustryStandard/SerialPortConsoleRedirectionTable.h>
#include <Library/AcpiLib.h>
#include <Library/DebugLib.h>
#include <Library/DevicePathLib.h>
#include <Library/DxeServicesLib.h>
#include <Library/DxeServicesTableLib.h>
//#include <Library/GpioLib.h>
#include <Library/HiiLib.h>
#include <Library/IoLib.h>
#include <Library/NetLib.h>
#include <Library/UefiBootServicesTableLib.h>
#include <Library/UefiRuntimeServicesTableLib.h>
#include <Library/PcdLib.h>
#include <Protocol/AcpiTable.h>
#include <STM32MP25.h>
#include <ConfigVars.h>
#include "ConfigDxeFormSetGuid.h"
#include "ConfigDxe.h"

#define FREQ_1_MHZ 1000000

extern UINT8 ConfigDxeHiiBin[];
extern UINT8 ConfigDxeStrings[];

STATIC STM32_FIRMWARE_PROTOCOL *mFwProtocol;
STATIC UINT32 mModelFamily = 0;
STATIC UINT32 mModelInstalledMB = 0;
STATIC UINT32 mModelRevision = 0;
// STATIC UINT32 mCoreClockRate = 0;

// STATIC EFI_MAC_ADDRESS  mMacAddress;

/*
 * The GUID inside Platform/RaspberryPi/RPi3/AcpiTables/AcpiTables.inf and
 * Platform/RaspberryPi/RPi4/AcpiTables/AcpiTables.inf _must_ match below.
 */
// STATIC CONST EFI_GUID mAcpiTableFile = {
//   0x7E374E25, 0x8E01, 0x4FEE, { 0x87, 0xf2, 0x39, 0x0C, 0x23, 0xC6, 0x06, 0xCD }
// };

typedef struct {
  VENDOR_DEVICE_PATH VendorDevicePath;
  EFI_DEVICE_PATH_PROTOCOL End;
} HII_VENDOR_DEVICE_PATH;

// #pragma pack (1)
// typedef struct {
//   MAC_ADDR_DEVICE_PATH            MacAddrDP;
//   EFI_DEVICE_PATH_PROTOCOL        End;
// } GENET_DEVICE_PATH;

// typedef struct {
//   GENET_DEVICE_PATH                   DevicePath;
//   BCM_GENET_PLATFORM_DEVICE_PROTOCOL  PlatformDevice;
// } GENET_DEVICE;
// #pragma pack ()

STATIC HII_VENDOR_DEVICE_PATH mVendorDevicePath = {
  {
    {
      HARDWARE_DEVICE_PATH,
      HW_VENDOR_DP,
      {
        (UINT8)(sizeof (VENDOR_DEVICE_PATH)),
        (UINT8)((sizeof (VENDOR_DEVICE_PATH)) >> 8)
      }
    },
    CONFIGDXE_FORM_SET_GUID
  },
  {
    END_DEVICE_PATH_TYPE,
    END_ENTIRE_DEVICE_PATH_SUBTYPE,
    {
      (UINT8)(END_DEVICE_PATH_LENGTH),
      (UINT8)((END_DEVICE_PATH_LENGTH) >> 8)
    }
  }
};

// STATIC GENET_DEVICE mGenetDevice = {
//   {
//     {
//       {
//         MESSAGING_DEVICE_PATH,
//         MSG_MAC_ADDR_DP,
//         {
//           (UINT8)(sizeof (MAC_ADDR_DEVICE_PATH)),
//           (UINT8)((sizeof (MAC_ADDR_DEVICE_PATH)) >> 8)
//         }
//       },
//       {{ 0 }},
//       NET_IFTYPE_ETHERNET
//     },
//     {
//       END_DEVICE_PATH_TYPE,
//       END_ENTIRE_DEVICE_PATH_SUBTYPE,
//       {
//         sizeof (EFI_DEVICE_PATH_PROTOCOL),
//         0
//       }
//     }
//   },
//   {
//     GENET_BASE_ADDRESS,
//     {{ 0 }}
//   }
// };


// STATIC
// VOID
// EFIAPI
// RegisterDevices (
//   EFI_EVENT           Event,
//   VOID                *Context
//   )
// {
//   EFI_HANDLE  Handle;
//   EFI_STATUS  Status;

//   if (mModelFamily == 4) {
//     DEBUG ((DEBUG_INFO, "GENET: MAC address %02X:%02X:%02X:%02X:%02X:%02X\n",
//             mMacAddress.Addr[0], mMacAddress.Addr[1], mMacAddress.Addr[2],
//             mMacAddress.Addr[3], mMacAddress.Addr[4], mMacAddress.Addr[5]));

//     CopyMem (&mGenetDevice.DevicePath.MacAddrDP.MacAddress, mMacAddress.Addr,
//       NET_ETHER_ADDR_LEN);
//     CopyMem (&mGenetDevice.PlatformDevice.MacAddress, mMacAddress.Addr,
//       NET_ETHER_ADDR_LEN);

//     Handle = NULL;
//     Status = gBS->InstallMultipleProtocolInterfaces (&Handle,
//                     &gEfiDevicePathProtocolGuid,          &mGenetDevice.DevicePath,
//                     &gBcmGenetPlatformDeviceProtocolGuid, &mGenetDevice.PlatformDevice,
//                     NULL);
//     ASSERT_EFI_ERROR (Status);
//   }
// }

STATIC EFI_STATUS
InstallHiiPages (
  VOID
  )
{
  EFI_STATUS     Status;
  EFI_HII_HANDLE HiiHandle;
  EFI_HANDLE     DriverHandle;

  DriverHandle = NULL;
  Status = gBS->InstallMultipleProtocolInterfaces (&DriverHandle,
                  &gEfiDevicePathProtocolGuid,
                  &mVendorDevicePath,
                  NULL);
  if (EFI_ERROR (Status)) {
    return Status;
  }

  HiiHandle = HiiAddPackages (&gConfigDxeFormSetGuid,
                DriverHandle,
                ConfigDxeStrings,
                ConfigDxeHiiBin,
                NULL);

  if (HiiHandle == NULL) {
    gBS->UninstallMultipleProtocolInterfaces (DriverHandle,
           &gEfiDevicePathProtocolGuid,
           &mVendorDevicePath,
           NULL);
    return EFI_OUT_OF_RESOURCES;
  }
  return EFI_SUCCESS;
}


STATIC EFI_STATUS
SetupVariables (
  VOID
  )
{
  UINTN      Size;
  // UINT8      Var8;
  UINT32     Var32;
  // CHAR16     AssetTagVar[ASSET_TAG_STR_STORAGE_SIZE] = L"";
  EFI_STATUS Status;

  /*
   * Create the vars with default value.
   * If we don't, forms won't be able to update.
   */

  Size = sizeof (UINT32);
  Status = gRT->GetVariable (L"CpuClock",
                  &gConfigDxeFormSetGuid,
                  NULL, &Size, &Var32);
  if (EFI_ERROR (Status)) {
    Status = PcdSet32S (PcdCpuClock, PcdGet32 (PcdCpuClock));
    ASSERT_EFI_ERROR (Status);
  }

  Size = sizeof (UINT32);
  Status = gRT->GetVariable (L"CustomCpuClock",
                             &gConfigDxeFormSetGuid,
                             NULL, &Size, &Var32);
  if (EFI_ERROR (Status)) {
    Status = PcdSet32S (PcdCustomCpuClock, PcdGet32 (PcdCustomCpuClock));
    ASSERT_EFI_ERROR (Status);
  }

  // if (mModelFamily >= 4 && mModelInstalledMB > 3 * 1024) {
  //   /*
  //    * This allows changing PcdRamLimitTo3GB in forms.
  //    */
  //   Status = PcdSet32S (PcdRamMoreThan3GB, 1);
  //   ASSERT_EFI_ERROR (Status);

  //   Size = sizeof (UINT32);
  //   Status = gRT->GetVariable (L"RamLimitTo3GB",
  //                              &gConfigDxeFormSetGuid,
  //                              NULL, &Size, &Var32);
  //   if (EFI_ERROR (Status)) {
  //     Status = PcdSet32S (PcdRamLimitTo3GB, PcdGet32 (PcdRamLimitTo3GB));
  //     ASSERT_EFI_ERROR (Status);
  //   }
  // } else {
  //   Status = PcdSet32S (PcdRamMoreThan3GB, 0);
  //   ASSERT_EFI_ERROR (Status);
  //   Status = PcdSet32S (PcdRamLimitTo3GB, 0);
  //   ASSERT_EFI_ERROR (Status);
  // }

