phanbagiabao2001/EDK2-STM32/Drivers/ConfigDxe/ConfigDxe.c
  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"SystemTableMode",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdSystemTableMode, PcdGet32 (PcdSystemTableMode));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"FanOnGpio",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdFanOnGpio, PcdGet32 (PcdFanOnGpio));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"FanTemp",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdFanTemp, PcdGet32 (PcdFanTemp));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // if (mModelFamily >= 4) {
  //   if (((mModelRevision >> 4) & 0xFF) == 0x14) {
  //     /*
  //      * Enable PCIe by default on CM4
  //      */
  //     Status = PcdSet32S (PcdXhciPci, 2);
  //     ASSERT_EFI_ERROR (Status);
  //   } else {
  //     Size = sizeof (UINT32);
  //     Status = gRT->GetVariable (L"XhciPci",
  //                                &gConfigDxeFormSetGuid,
  //                                NULL, &Size, &Var32);
  //     if (EFI_ERROR (Status) || (Var32 == 0)) {
  //       /*
  //        * Enable XHCI by default
  //        */
  //       Status = PcdSet32S (PcdXhciPci, 0);
  //       ASSERT_EFI_ERROR (Status);
  //     } else {
  //       /*
  //        * Enable PCIe
  //        */
  //       Status = PcdSet32S (PcdXhciPci, 1);
  //       ASSERT_EFI_ERROR (Status);
  //     }

  //     Size = sizeof (UINT32);
  //     Status = gRT->GetVariable (L"XhciReload",
  //                                &gConfigDxeFormSetGuid,
  //                                NULL, &Size, &Var32);
  //     if (EFI_ERROR (Status)) {
  //       Status = PcdSet32S (PcdXhciReload, PcdGet32 (PcdXhciReload));
  //       ASSERT_EFI_ERROR (Status);
  //     }

  //   }
  // } else {
  //   /*
  //    * Disable PCIe and XHCI
  //    */
  //   Status = PcdSet32S (PcdXhciPci, 0);
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (AssetTagVar);
  // Status = gRT->GetVariable (L"AssetTag",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, AssetTagVar);

  // if (EFI_ERROR (Status)) {
  //   Status = gRT->SetVariable (
  //                   L"AssetTag",
  //                   &gConfigDxeFormSetGuid,
  //                   EFI_VARIABLE_NON_VOLATILE | EFI_VARIABLE_BOOTSERVICE_ACCESS | EFI_VARIABLE_RUNTIME_ACCESS,
  //                   sizeof (AssetTagVar),
  //                   AssetTagVar
  //                   );
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"SdIsArasan",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdSdIsArasan, PcdGet32 (PcdSdIsArasan));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcDisableMulti",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcDisableMulti, PcdGet32 (PcdMmcDisableMulti));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcForce1Bit",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcForce1Bit, PcdGet32 (PcdMmcForce1Bit));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcForceDefaultSpeed",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcForceDefaultSpeed, PcdGet32 (PcdMmcForceDefaultSpeed));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcSdDefaultSpeedMHz",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcSdDefaultSpeedMHz, PcdGet32 (PcdMmcSdDefaultSpeedMHz));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcSdHighSpeedMHz",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcSdHighSpeedMHz, PcdGet32 (PcdMmcSdHighSpeedMHz));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"MmcEnableDma",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdMmcEnableDma, PcdGet32 (PcdMmcEnableDma));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"DebugEnableJTAG",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdDebugEnableJTAG, PcdGet32 (PcdDebugEnableJTAG));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT8);
  // Status = gRT->GetVariable (L"DisplayEnableScaledVModes",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var8);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet8S (PcdDisplayEnableScaledVModes, PcdGet8 (PcdDisplayEnableScaledVModes));
  //   ASSERT_EFI_ERROR (Status);
  // }

  // Size = sizeof (UINT32);
  // Status = gRT->GetVariable (L"DisplayEnableSShot",
  //                 &gConfigDxeFormSetGuid,
  //                 NULL, &Size, &Var32);
  // if (EFI_ERROR (Status)) {
  //   Status = PcdSet32S (PcdDisplayEnableSShot, PcdGet32 (PcdDisplayEnableSShot));
  //   ASSERT_EFI_ERROR (Status);
  // }

