phanbagiabao2001/EDK2-STM32/Drivers/ConfigDxe/ConfigDxe.c
  // if (mModelFamily == 4) {
  //   //
  //   // Get the MAC address from the firmware.
  //   //
  //   Status = mFwProtocol->GetMacAddress (mMacAddress.Addr);
  //   if (EFI_ERROR (Status)) {
  //     DEBUG ((DEBUG_WARN, "%a: failed to retrieve MAC address\n", __FUNCTION__));
  //   }
  // }

  return EFI_SUCCESS;
}


STATIC VOID
ApplyVariables (
  VOID
  )
{
  // UINTN Gpio34Group;
  // UINTN Gpio48Group;
  EFI_STATUS Status;
  UINT32 CpuClock = PcdGet32 (PcdCpuClock);
  // UINT32 CustomCpuClock = PcdGet32 (PcdCustomCpuClock);
  UINT32 Rate = 0;
  // UINT32 FanOnGpio = PcdGet32 (PcdFanOnGpio);

  // switch (CpuClock) {
  // case CHIPSET_CPU_CLOCK_LOW:
  //   Rate = FixedPcdGet32 (PcdCpuLowSpeedMHz) * FREQ_1_MHZ;
  //   break;
  // case CHIPSET_CPU_CLOCK_DEFAULT:
  //   /*
  //    * What the Raspberry Pi Foundation calls "max clock rate" is really the default value
  //    * from: https://www.raspberrypi.org/documentation/configuration/config-txt/overclocking.md
  //    */
  //   Status = mFwProtocol->GetMaxClockRate (0x000000003, &Rate);
  //   if (Status != EFI_SUCCESS) {
  //     DEBUG ((DEBUG_ERROR, "Couldn't read default CPU speed %r\n", Status));
  //   }
  //   break;
  // case CHIPSET_CPU_CLOCK_MAX:
  //   Rate = FixedPcdGet32 (PcdCpuMaxSpeedMHz) * FREQ_1_MHZ;
  //   break;
  // case CHIPSET_CPU_CLOCK_CUSTOM:
  //   Rate = CustomCpuClock * FREQ_1_MHZ;
  //   break;
  // }

  if (CpuClock != 0) {
    if (CpuClock == 2) {
      /*
       * Maximum: 1.2GHz on RPi 3, 1.4GHz on RPi 3B+, unless
       * overridden with arm_freq=xxx in config.txt.
       */
      Status = mFwProtocol->GetMaxClockRate(0x000000003, &Rate);
      if (Status != EFI_SUCCESS) {
        DEBUG((EFI_D_ERROR, "Couldn't get the max CPU speed, leaving as is: %r\n",
               Status));
      }
    } else {
      Rate = 600 * 1000000;
    }
  }

  if (Rate != 0) {
    DEBUG ((DEBUG_INFO, "Setting CPU speed to %u MHz\n", Rate / FREQ_1_MHZ));
    Status = mFwProtocol->SetClockRate (0x000000003, Rate, 1);
    if (Status != EFI_SUCCESS) {
      DEBUG ((DEBUG_ERROR, "Couldn't set the CPU speed: %r\n", Status));
    } else {
      Status = PcdSet32S (PcdCustomCpuClock, Rate / FREQ_1_MHZ);
      ASSERT_EFI_ERROR (Status);
    }
  }

  Status = mFwProtocol->GetClockRate (0x000000003, &Rate);
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't get the CPU speed: %r\n", Status));
  } else {
    DEBUG ((DEBUG_INFO, "Current CPU speed is %u MHz\n", Rate / FREQ_1_MHZ));
  }

}


typedef struct {
  CHAR8 Name[4];
  UINTN PcdToken;
} AML_NAME_OP_REPLACE;

typedef struct {
  UINT64                      OemTableId;
  UINTN                       PcdToken;
  UINTN                       PcdTokenNot;
  CONST AML_NAME_OP_REPLACE   *SdtNameOpReplace;
} NAMESPACE_TABLES;

#define SSDT_PATTERN_LEN 5
#define AML_NAMEOP_8   0x0A
#define AML_NAMEOP_16  0x0B
#define AML_NAMEOP_32  0x0C
#define AML_NAMEOP_STR 0x0D
//
// Scan the given namespace table (DSDT/SSDT) for AML NameOps
// listed in the NameOpReplace structure. If one is found then
// update the value in the table from the specified Pcd
//
// This allows us to have conditionals in AML controlled
// by options in the BDS or detected during firmware bootstrap.
// We could extend this concept for strings/etc but due to len
// variations its probably easier to encode the strings
// in the ASL and pick the correct one based off a variable.
//
// STATIC
// VOID
// UpdateSdtNameOps (
//   EFI_ACPI_DESCRIPTION_HEADER  *AcpiTable,
//   CONST AML_NAME_OP_REPLACE    *NameOpReplace
//   )
// {
//   UINTN  Idx;
//   UINTN  Index;
//   CHAR8  Pattern[SSDT_PATTERN_LEN];
//   UINTN  PcdVal;
//   UINT8  *SdtPtr;
//   UINT32 SdtSize;

//   SdtSize = AcpiTable->Length;

//   if (SdtSize > 0) {
//     SdtPtr = (UINT8 *)AcpiTable;

//     for (Idx = 0; NameOpReplace && NameOpReplace[Idx].PcdToken; Idx++) {
//       //
//       // Do a single NameOp variable replacement these are of the
//       // form 08 XXXX SIZE VAL, where SIZE is 0A=byte, 0B=word, 0C=dword
//       // and XXXX is the name and VAL is the value
//       //
//       Pattern[0] = 0x08;
//       Pattern[1] = NameOpReplace[Idx].Name[0];
//       Pattern[2] = NameOpReplace[Idx].Name[1];
//       Pattern[3] = NameOpReplace[Idx].Name[2];
//       Pattern[4] = NameOpReplace[Idx].Name[3];

//       for (Index = 0; Index < (SdtSize - SSDT_PATTERN_LEN); Index++) {
//         if (CompareMem (SdtPtr + Index, Pattern, SSDT_PATTERN_LEN) == 0) {
//           PcdVal = LibPcdGet32 (NameOpReplace[Idx].PcdToken);
//           switch (SdtPtr[Index + SSDT_PATTERN_LEN]) {
//           case AML_NAMEOP_32:
//             SdtPtr[Index + SSDT_PATTERN_LEN + 4] = (PcdVal >> 24) & 0xFF;
//             SdtPtr[Index + SSDT_PATTERN_LEN + 3] = (PcdVal >> 16) & 0xFF;
//             // Fallthrough
//           case AML_NAMEOP_16:
//             SdtPtr[Index + SSDT_PATTERN_LEN + 2] = (PcdVal >> 8) & 0xFF;
//             // Fallthrough
//           case AML_NAMEOP_8:
//             SdtPtr[Index + SSDT_PATTERN_LEN + 1] = PcdVal & 0xFF;
//             break;
//           case 0:
//           case 1:
//             SdtPtr[Index + SSDT_PATTERN_LEN + 1] = !!PcdVal;
//             break;
//           case AML_NAMEOP_STR:
//             //
//             // If the string val is added to the NameOpReplace, we can
//             // dynamically update things like _HID too as long as the
//             // string length matches.
//             //
//             break;
//           }
//           break;
//         }
//       }
//     }
//   }
// }


// STATIC
// BOOLEAN
// VerifyUpdateTable (
//   IN  EFI_ACPI_DESCRIPTION_HEADER   *AcpiHeader,
//   IN  CONST NAMESPACE_TABLES        *SdtTable
//   )
// {
//   BOOLEAN Result;

//   Result = TRUE;
//   if (SdtTable->PcdToken && !LibPcdGet32 (SdtTable->PcdToken)) {
//     Result = FALSE;
//   }
//   if (SdtTable->PcdTokenNot && LibPcdGet32 (SdtTable->PcdTokenNot)) {
//     Result = FALSE;
//   }
//   if (Result && SdtTable->SdtNameOpReplace) {
//     UpdateSdtNameOps (AcpiHeader, SdtTable->SdtNameOpReplace);
//   }

//   return Result;
// }

STATIC CONST AML_NAME_OP_REPLACE SsdtNameOpReplace[] = {
  { "GIOP", PcdToken (PcdFanOnGpio) },
  { "FTMP", PcdToken (PcdFanTemp) },
  { }
};

