phanbagiabao2001/EDK2-STM32/Drivers/ConfigDxe/ConfigDxe.c
STATIC CONST AML_NAME_OP_REPLACE SsdtEmmcNameOpReplace[] = {
  { "SDMA", PcdToken (PcdMmcEnableDma) },
  { }
};

STATIC CONST AML_NAME_OP_REPLACE DsdtNameOpReplace[] = {
  { "URIU", PcdToken (PcdUartInUse) },
  { "MUCR", PcdToken (PcdMiniUartClockRate) },
  { }
};

STATIC CONST NAMESPACE_TABLES SdtTables[] = {
  {
    SIGNATURE_64 ('R', 'P', 'I', 'T', 'H', 'F', 'A', 'N'),
    PcdToken(PcdFanOnGpio),
    0,
    SsdtNameOpReplace
  },
  {
    SIGNATURE_64 ('R', 'P', 'I', '4', 'E', 'M', 'M', 'C'),
    0,
    PcdToken(PcdSdIsArasan),
    SsdtEmmcNameOpReplace
  },
  { // DSDT
    SIGNATURE_64 ('R', 'P', 'I', 0, 0, 0, 0, 0),
    0,
    0,
    DsdtNameOpReplace
  },
  { }
};

//
// Monitor the ACPI tables being installed and when
// a DSDT/SSDT is detected validate that we want to
// install it, and if so update any "NameOp" defined
// variables contained in the table from PCD values
//
// STATIC
// BOOLEAN
// HandleDynamicNamespace (
//   IN  EFI_ACPI_DESCRIPTION_HEADER   *AcpiHeader
//   )
// {
//   UINTN Tables;

//   EFI_ACPI_SERIAL_PORT_CONSOLE_REDIRECTION_TABLE *SpcrTable;
//   DBG2_TABLE                                     *Dbg2Table;

//   switch (AcpiHeader->Signature) {
//   case SIGNATURE_32 ('D', 'S', 'D', 'T'):
//   case SIGNATURE_32 ('S', 'S', 'D', 'T'):
//     for (Tables = 0; SdtTables[Tables].OemTableId; Tables++) {
//       if (AcpiHeader->OemTableId == SdtTables[Tables].OemTableId) {
//         return VerifyUpdateTable (AcpiHeader, &SdtTables[Tables]);
//       }
//     }
//     DEBUG ((DEBUG_ERROR, "Found namespace table not in table list.\n"));
//     return FALSE;

//   case SIGNATURE_32 ('I', 'O', 'R', 'T'):
//     // only enable the IORT on machines with >3G and no limit
//     // to avoid problems with rhel/centos and other older OSs
//     if (PcdGet32 (PcdRamLimitTo3GB) || !PcdGet32 (PcdRamMoreThan3GB)) {
//       return FALSE;
//     }
//     return TRUE;

//   case SIGNATURE_32 ('S', 'P', 'C', 'R'):
//     SpcrTable = (EFI_ACPI_SERIAL_PORT_CONSOLE_REDIRECTION_TABLE *)AcpiHeader;
//     if ((PcdGet32 (PcdUartInUse) == PL011_UART_IN_USE) &&
//         (SpcrTable->InterfaceType == EFI_ACPI_SERIAL_PORT_CONSOLE_REDIRECTION_TABLE_INTERFACE_TYPE_ARM_PL011_UART)) {
//       return TRUE;
//     } else if ((PcdGet32 (PcdUartInUse) == MINI_UART_IN_USE) &&
//                (SpcrTable->InterfaceType == EFI_ACPI_SERIAL_PORT_CONSOLE_REDIRECTION_TABLE_INTERFACE_TYPE_BCM2835_UART)) {
//       return TRUE;
//     }
//     return FALSE;

//   case SIGNATURE_32 ('D', 'B', 'G', '2'):
//     Dbg2Table = (DBG2_TABLE *)AcpiHeader;
//     if ((PcdGet32 (PcdUartInUse) == PL011_UART_IN_USE) &&
//         (Dbg2Table->Dbg2DeviceInfo[0].Dbg2Device.PortSubtype == EFI_ACPI_DBG2_PORT_SUBTYPE_SERIAL_ARM_PL011_UART)) {
//       return TRUE;
//     } else if ((PcdGet32 (PcdUartInUse) == MINI_UART_IN_USE) &&
//                (Dbg2Table->Dbg2DeviceInfo[0].Dbg2Device.PortSubtype == EFI_ACPI_DBG2_PORT_SUBTYPE_SERIAL_BCM2835_UART)) {
//       return TRUE;
//     }
//     return FALSE;
//   }

//   return TRUE;
// }


EFI_STATUS
EFIAPI
ConfigInitialize (
  IN EFI_HANDLE ImageHandle,
  IN EFI_SYSTEM_TABLE *SystemTable
  )
{
  EFI_STATUS                      Status;
  // EFI_EVENT                       EndOfDxeEvent;

  // if ((MmioRead32(GPIO_GPFSEL1) & GPFSEL1_UART_MASK) == PL011_UART_IN_USE_REG_VALUE) {
  //   PcdSet32S (PcdUartInUse, PL011_UART_IN_USE);
  // } else if ((MmioRead32(GPIO_GPFSEL1) & GPFSEL1_UART_MASK) == MINI_UART_IN_USE_REG_VALUE) {
  //   PcdSet32S (PcdUartInUse, MINI_UART_IN_USE);
  // }

  Status = gBS->LocateProtocol (&gSTM32FirmwareProtocolGuid,
                  NULL, (VOID**)&mFwProtocol);
  ASSERT_EFI_ERROR (Status);
  if (EFI_ERROR (Status)) {
    return Status;
  }

  Status = mFwProtocol->GetModelFamily (&mModelFamily);
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't get the Raspberry Pi model family: %r\n", Status));
  } else {
    DEBUG ((DEBUG_INFO, "Current Raspberry Pi model family is %d\n", mModelFamily));
  }

  Status = mFwProtocol->GetModelInstalledMB (&mModelInstalledMB);
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't get the Raspberry Pi installed RAM size: %r\n", Status));
  } else {
    DEBUG ((DEBUG_INFO, "Current Raspberry Pi installed RAM size is %d MB\n", mModelInstalledMB));
  }

  Status = mFwProtocol->GetModelRevision (&mModelRevision);
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't get the Raspberry Pi revision: %r\n", Status));
  } else {
    DEBUG ((DEBUG_INFO, "Current Raspberry Pi revision %x\n", mModelRevision));
  }

  // Status = mFwProtocol->GetClockRate (RPI_MBOX_CLOCK_RATE_CORE, &mCoreClockRate);
  // if (Status != EFI_SUCCESS) {
  //   DEBUG ((DEBUG_ERROR, "Couldn't get the Raspberry Pi core clock rate: %r\n", Status));
  // } else {
  //   PcdSet32S (PcdMiniUartClockRate, mCoreClockRate);
  // }

  Status = SetupVariables ();
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't not setup NV vars: %r\n", Status));
  }

  ApplyVariables ();
  Status = gBS->InstallProtocolInterface (&ImageHandle,
                  &gSTM32ConfigAppliedProtocolGuid,
                  EFI_NATIVE_INTERFACE,
                  NULL);
  ASSERT_EFI_ERROR (Status);

  Status = InstallHiiPages ();
  if (Status != EFI_SUCCESS) {
    DEBUG ((DEBUG_ERROR, "Couldn't install ConfigDxe configuration pages: %r\n", Status));
  }

  // if (PcdGet32 (PcdSystemTableMode) == SYSTEM_TABLE_MODE_ACPI ||
  //     PcdGet32 (PcdSystemTableMode) == SYSTEM_TABLE_MODE_BOTH) {
  //    Status = LocateAndInstallAcpiFromFvConditional (&mAcpiTableFile,
  //                                                    &HandleDynamicNamespace);
  //    ASSERT_EFI_ERROR (Status);
  // }

  // Status = gBS->CreateEventEx (EVT_NOTIFY_SIGNAL, TPL_NOTIFY, RegisterDevices,
  //                 NULL, &gEfiEndOfDxeEventGroupGuid, &EndOfDxeEvent);
  // ASSERT_EFI_ERROR (Status);


  if (mModelFamily == 4) {
    RegisterXhciQuirkHandler (mFwProtocol);
  }

  return EFI_SUCCESS;
}
